Repository: microsoft/Power-Fx
Catalog: src/strings/*/PowerFxResources.resw
Source language: en_us
Languages: bg_bg, ca_es, cs_cz, da_dk, de_de, el_gr, es_es, et_ee, eu_es, fi_fi, fr_fr, gl_es, hi_in, hr_hr, hu_hu, it_it, ja_jp, kk_kz, ko_kr, lt_lt, lv_lv, ms_my, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ro_ro, ru_ru, sk_sk, sl_si, sr_cyrl_rs, sr_latn_rs, sv_se, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_tw

# InvalidXml_AttributeValueInvalidGuid_AttrName_Value
source: The attribute '{0}' has an invalid GUID value '{1}'.
bg_bg: Атрибутът „{0}“ има невалидна GUID стойност „{1}“.
ca_es: L'atribut '{0}' té un valor GUID '{1}' que no és vàlid.
cs_cz: Atribut {0} má neplatnou hodnotu identifikátoru GUID {1}.
da_dk: Attributten '{0}' har en ugyldig GUID-værdi: '{1}'.
de_de: Das Attribut "{0}" weist einen ungültigen GUID-Wert "{1}" auf.
el_gr: Το χαρακτηριστικό '{0}' έχει μη έγκυρη τιμή GUID '{1}'.
es_es: El atributo '{0}' tiene un valor de GUID no válido '{1}'.
et_ee: Atribuudil {0} on sobimatu GUID-väärtus {1}.
eu_es: '{0}' atributuak '{1}' GUID balio baliogabea du.
fi_fi: Attribuutilla {0} on virheellinen GUID-arvo {1}.
fr_fr: L’attribut « {0} » a une valeur GUID non valide « {1} ».
gl_es: O atributo '{0}' ten un valor de GUID '{1}' non válido.
hi_in: एट्रिब्यूट '{0}' में एक अमान्य GUID मान '{1}' है.
hr_hr: Atribut "{0}" ima GUID vrijednost koja nije valjana: "{1}".
hu_hu: A(z) {0} attribútumnak érvénytelen a(z) {1} GUID-értéke.
it_it: L'attributo '{0}' ha un valore GUID non valido '{1}'.
ja_jp: 属性 '{0}' に無効な GUID 値 '{1}' が含まれています。
kk_kz: "{0}" атрибутында жарамсыз "{1}" GUID мәні бар.
ko_kr: 특성 '{0}'에 잘못된 GUID 값 '{1}'이(가) 있습니다.
lt_lt: Atributas „{0}“ turi neleistiną GUID reikšmę „{1}“.
lv_lv: Atribūtam {0} ir nederīga GUID vērtība {1}.
ms_my: Atribut '{0}' mempunyai nilai UID '{1}' tidak sah.
nb_no: Attributtet {0} har en ugyldig GUID-verdi: {1}.
nl_nl: Het kenmerk {0} heeft een ongeldige GUID-waarde {1}.
pl_pl: Atrybut „{0}” ma nieprawidłową wartość GUID „{1}”.
pt_br: O atributo '{0}' tem um valor de GUID inválido: {1}.
pt_pt: O atributo "{0}" tem um valor GUID inválido: "{1}".
ro_ro: Atributul „{0}” are o valoare GUID nevalidă „{1}”.
ru_ru: Атрибут "{0}" имеет недопустимое значение GUID "{1}".
sk_sk: Atribút {0} má neplatnú hodnotu GUID {1}.
sl_si: Vrednost GUID »{1}« parametra »{0}« je neveljavna.
sr_cyrl_rs: Атрибут „{0}“ има неважећу GUID вредност: „{1}“.
sr_latn_rs: Atribut „{0}“ ima nevažeću GUID vrednost: „{1}“.
sv_se: Attributet {0} har ett ogiltigt GUID-värde {1}.
th_th: แอตทริบิวต์ {0} มีค่า GUID ไม่ถูกต้อง '{1}'
tr_tr: '{0}' özniteliğinde geçersiz bir GUID değeri var: '{1}'.
uk_ua: Атрибут "{0}" містить неприпустиме значення GUID "{1}".
vi_vn: Thuộc tính '{0}' chứa một giá trị GUID không hợp lệ '{1}'.
zh_cn: 属性“{0}”具有无效的 GUID 值“{1}”。
zh_tw: 屬性 '{0}' 的 GUID 值 '{1}' 無效。

# InvalidJson_MissingRequiredNamedValue_PropName
source: The property '{0}' is missing.
bg_bg: Свойството „{0}“ липсва.
ca_es: Falta la propietat '{0}'.
cs_cz: Chybí vlastnost {0}.
da_dk: Egenskaben '{0}' mangler.
de_de: Die Eigenschaft "{0}" fehlt.
el_gr: Η ιδιότητα '{0}' λείπει.
es_es: Falta la propiedad '{0}'.
et_ee: Atribuut {0} puudub.
eu_es: '{0}' propietatea ez dago.
fi_fi: Ominaisuus {0} puuttuu.
fr_fr: La propriété « {0} » est manquante.
gl_es: Falta a propiedade '{0}'.
hi_in: गुण '{0}' अनुपलब्ध है.
hr_hr: Svojstvo "{0}" nedostaje.
hu_hu: A(z) {0} tulajdonság hiányzik.
it_it: La proprietà '{0}' manca.
ja_jp: プロパティ '{0}' がありません。
kk_kz: "{0}" сипаты жоқ.
ko_kr: 속성 '{0}'이(가) 누락되었습니다.
lt_lt: Nėra ypatybės „{0}“.
lv_lv: Trūkst rekvizīta {0}.
ms_my: Sifat '{0}' tiada.
nb_no: Egenskapen {0} mangler.
nl_nl: De eigenschap {0} ontbreekt.
pl_pl: Brak właściwości „{0}”.
pt_br: A propriedade '{0}' está ausente.
pt_pt: A propriedade "{0}" está em falta.
ro_ro: Proprietatea „{0}” lipsește.
ru_ru: Свойство "{0}" отсутствует.
sk_sk: Vlastnosť {0} chýba.
sl_si: Manjka lastnost »{0}«.
sr_cyrl_rs: Својство „{0}“ недостаје.
sr_latn_rs: Svojstvo „{0}“ nedostaje.
sv_se: Egenskapen {0} saknas.
th_th: คุณสมบัติ '{0}' หายไป
tr_tr: '{0}' özelliği eksik.
uk_ua: Властивість "{0}" відсутня.
vi_vn: Thuộc tính '{0}' bị thiếu.
zh_cn: 缺少属性“{0}”。
zh_tw: 遺漏屬性 '{0}'。

# InvalidJson_NamedValueTypeNotCorrect_PropName_ExpectedType_ActualType
source: The property '{0}' has an invalid type value: {2}. Expected type value: {1}.
bg_bg: Свойството „{0}“ има невалиден тип стойност: {2}. Очакван тип стойност: {1}.
ca_es: La propietat '{0}' té un valor de tipus que no és vàlid: {2}. S'esperava el valor de tipus: {1}.
cs_cz: Vlastnost {0} má neplatnou hodnotu typu: {2}. Očekávaná hodnota typu je: {1}.
da_dk: Egenskaben '{0}' har en ugyldig typeværdi: {2}. Forventet typeværdi: {1}.
de_de: Die Eigenschaft "{0}" weist den ungültigen Typwert "{2}" auf. Erwarteter Typwert: {1}.
el_gr: Η ιδιότητα '{0}' έχει μη έγκυρη τιμή τύπου: {2}. Αναμενόταν τιμή τύπου: {1}.
es_es: La propiedad '{0}' tiene un valor de tipo no válido: {2}. Valor de tipo esperado: {1}.
et_ee: Atribuudil {0} on sobimatu tüübiväärtus: {2}. Eeldati tüübiväärtust {1}.
eu_es: '{0}' propietateak {2} motaren balio baliogabea du. Espero den motaren balioa: {1}.
fi_fi: Ominaisuudella {0} on virheellinen tyyppiarvo: {2}. Odotettu tyyppiarvo: {1}.
fr_fr: La propriété « {0} » a une valeur de type non valide : {2}. Valeur de type attendue : {1}.
gl_es: A propiedade '{0}' ten un valor de tipo non válido: {2}. Esperábase un valor de tipo: {1}.
hi_in: गुण '{0}' में एक अमान्य प्रकार मान है: {2}. अपेक्षित प्रकार मान: {1}.
hr_hr: Svojstvo {0} sadrži vrijednost vrste: {2} koja nije valjana. Očekivana je vrijednost vrste: {1}.
hu_hu: A(z) {0} tulajdonságnak érvénytelen a típusértéke: {2}. Az elvárt típusérték: {1}.
it_it: La proprietà '{0}' ha un valore tipo non valido: {2}. Valore di tipo previsto: {1}.
ja_jp: プロパティ {0} に無効な型の値 {2} が含まれます。予期される型の値: {1}。
kk_kz: "{0}" сипатында жарамсыз түрдегі мән бар: {2}. Күтілген түр мәні: {1}.
ko_kr: 속성 '{0}'에 잘못된 형식 값 {2}이(가) 있습니다. 필요한 형식 값은 {1}입니다.
lt_lt: Ypatybė „{0}“ turi neleistiną tipo reikšmę: {2}. Numatyta tipo reikšmė: {1}.
lv_lv: Rekvizītam {0} ir nederīga tipa vērtība: {2}. Paredzētā tipa vērtība: {1}.
ms_my: Sifat '{0}' mempunyai nilai jenis tidak sah: {2}. Nilai jenis yang dijangka: {1}.
nb_no: Egenskapen {0} har en ugyldig typeverdi: {2}. Forventet typeverdien {1}.
nl_nl: De eigenschap {0} heeft een ongeldige typewaarde: {2}. De verwachte typewaarde is: {1}.
pl_pl: Właściwość „{0}” ma nieprawidłową wartość typu: {2}. Oczekiwana wartość typu: {1}.
pt_br: A propriedade '{0}' tem um valor de tipo inválido: {2}. Valor do tipo esperado: {1}.
pt_pt: A propriedade "{0}" tem um tipo de valor inválido: {2}. Tipo de valor esperado: {1}.
ro_ro: Proprietatea „{0}” are o valoare de tip nevalidă: {2}. Valoarea de tip așteptată: {1}.
ru_ru: Свойство "{0}" имеет недопустимый тип: {2}. Ожидаемый тип: {1}.
sk_sk: Vlastnosť {0} má neplatnú hodnotu typu: {2}. Očakávaná hodnota typu: {1}.
sl_si: lastnost »{0}« ima neveljavno vrednost tipa: {2}. Pričakovana vrednost tipa: {1}.
sr_cyrl_rs: Својство „{0}“ има неважећу вредност типа: {2}. Очекивана вредност типа: {1}.
sr_latn_rs: Svojstvo „{0}“ ima nevažeću vrednost tipa: {2}. Očekivana vrednost tipa: {1}.
sv_se: Egenskapen {0} har ett ogiltigt typvärde: {2}. Förväntat typvärde: {1}.
th_th: คุณสมบัติ {0} มีประเภทค่าไม่ถูกต้อง: '{2}' ประเภทค่าที่ถูกต้อง: '{1}'
tr_tr: '{0}' özelliğinde geçersiz bir tür değeri var: {2}. Beklenen tür değeri: {1}.
uk_ua: Властивість "{0}" має значення неприпустимого типу: {2}. Очікувий тип: {1}.
vi_vn: Thuộc tính '{0}' chứa giá trị loại không hợp lệ: {2}. Giá trị loại theo dự kiến: {1}.
zh_cn: 属性“{0}”具有无效类型值: {2}。需要类型值: {1}。
zh_tw: 屬性 '{0}' 的類型值 {2} 無效。應為類型值: {1}。

# InvalidJson_NamedValueCannotBeEmpty_PropName
source: The property '{0}' cannot be empty.
bg_bg: Свойството „{0}“ не може да бъде празно.
ca_es: La propietat '{0}' no pot estar buida.
cs_cz: Vlastnost {0} nemůže být prázdná.
da_dk: Egenskaben '{0}' må ikke være tom.
de_de: Die Eigenschaft "{0}" darf nicht leer sein.
el_gr: Η ιδιότητα '{0}' δεν μπορεί να είναι κενή.
es_es: La propiedad '{0}' no puede estar vacía.
et_ee: Atribuut {0} ei tohi olla tühi.
eu_es: '{0}' propietateak ezin du hutsik egon.
fi_fi: Ominaisuus {0} ei voi olla tyhjä.
fr_fr: La propriété « {0} » ne peut pas être vide.
gl_es: A propiedade '{0}' non pode estar baleira.
hi_in: गुण '{0}' रिक्त नहीं हो सकता.
hr_hr: Svojstvo "{0}" ne može biti prazno.
hu_hu: A(z) {0} tulajdonság nem lehet üres.
it_it: La proprietà '{0}' non può essere vuota.
ja_jp: プロパティ '{0}' を空にすることはできません。
kk_kz: "{0}" сипаты бос болмауы тиіс.
ko_kr: 속성 '{0}'은(는) 비워 둘 수 없습니다.
lt_lt: Ypatybė „{0}“ negali būti tuščia.
lv_lv: Rekvizīts {0} nedrīkst būt tukšs.
ms_my: Sifat '{0}' tidak boleh kosong.
nb_no: Egenskapen {0} kan ikke være tom.
nl_nl: De eigenschap {0} mag niet leeg zijn.
pl_pl: Właściwość „{0}” nie może być pusta.
pt_br: A propriedade '{0}' não pode ficar em branco.
pt_pt: A propriedade "{0}" não pode estar vazia.
ro_ro: Proprietatea „{0}” nu poate fi goală.
ru_ru: Свойство "{0}" не может быть пустым.
sk_sk: Vlastnosť {0} nemôže byť prázdna.
sl_si: Lastnost »{0}« ne sme biti prazna.
sr_cyrl_rs: Својство „{0}“ не може да буде празно.
sr_latn_rs: Svojstvo „{0}“ ne može da bude prazno.
sv_se: Egenskapen {0} får inte vara tom.
th_th: คุณสมบัติ '{0}' ไม่สามารถว่างเปล่าได้
tr_tr: '{0}' özelliği boş olamaz.
uk_ua: Властивість "{0}" не може бути пустою.
vi_vn: Không thể để trống thuộc tính '{0}'.
zh_cn: 属性“{0}”不能为空。
zh_tw: 屬性 '{0}' 不可為空白。

# InvalidJson_NamedEnumStringInvalid_PropName_ActualValue
source: The enum '{0}' is expected to have a valid value but its value {1} is out of range for the enum.
bg_bg: Очаква се числената стойност „{0}“ да има валидна стойност, но нейната стойност {1} е извън диапазона за числената стойност.
ca_es: S'espera que l'enumeració "{0}" tingui un valor vàlid, però el valor {1} està fora de l'interval de l'enumeració.
cs_cz: Výčet {0} má mít platnou hodnotu, ale jeho hodnota {1} je pro daný výčet mimo rozsah.
da_dk: Enum '{0}' forventes at være en gyldig værdi, men dens værdi {1} er uden for enum-området.
de_de: Für die Enumeration "{0}" wird ein gültiger Wert erwartet, der Wert "{1}" liegt jedoch außerhalb des gültigen Bereichs für die Enumeration.
el_gr: Η απαρίθμηση "{0}" αναμένεται να έχει έγκυρη τιμή, αλλά η τιμή {1} είναι εκτός περιοχής για την απαρίθμηση.
es_es: La enumeración "{0}" debe tener un valor válido, pero su valor ({1}) está fuera de intervalo.
et_ee: Eeldatakse, et loetelul '{0}' on kehtiv väärtus, kuid selle väärtus {1} on loetelu puhul vahemikust väljas.
eu_es: "{0}" enum balioak erabil daitekeen balio bat eduki behar du, baina balioa ({1}) enum balioaren barrutitik kanpo dago.
fi_fi: Luetteloinnilla {0} odotetaan olevan kelvollinen arvo, mutta sen arvo {1} on luetteloinnin ulkopuolella.
fr_fr: La propriété enum « {0} » doit avoir une valeur valide, mais sa valeur {1} est hors limites.
gl_es: Espérase que a enumeración "{0}" teña un valor válido, pero o valor {1} está fóra do intervalo da enumeración.
hi_in: ऐनम '{0}' में मान्य मान होना अपेक्षित है, लेकिन ऐनम के लिए इसका मान {1} श्रेणी से बाहर है.
hr_hr: Očekuje se da numerator "{0}" sadrži valjanu vrijednost, ali njegova je vrijednost {1} izvan raspona za numerator.
hu_hu: A(z) {0} enumerátornak érvényes értékkel kellene rendelkeznie, de az értéke ({1}) kívül esik az engedélyezett tartományon.
it_it: Per l'enumerazione '{0}' è previsto un valore valido, ma il relativo valore {1} non è compreso nell'intervallo per l'enumerazione.
ja_jp: 列挙型 '{0}' には有効な値を設定する必要がありますが、その値 {1} は列挙値の範囲外です。
kk_kz: "{0}" сипатында жарамды мәннің болуы күтіледі, бірақ оның {1} мәні ауқымнан тыс.
ko_kr: 열거 '{0}'에 유효한 값이 필요한데 해당 값 {1}이(가) 열거의 범위를 벗어났습니다.
lt_lt: Numatyta, kad išvardijimo {0} reikšmė bus tinkama, bet jo reikšmė {1} nepatenka į diapazoną.
lv_lv: Uzskaitījuma iestatījumā {0} jābūt derīgai vērtībai, taču tā vērtība {1} ir ārpus uzskaitījuma diapazona.
ms_my: Sifat '{0}' dijangka mempunyai nilai integer tetapi nilai {1} di luar julat.
nb_no: Opplistingen {0} er forventet å ha en gyldig verdi, men verdien {1} er utenfor området for opplistingen.
nl_nl: Voor de opsomming {0} wordt een geldige waarde verwacht, maar de waarde {1} van de opsomming valt buiten het bereik van de opsomming.
pl_pl: Wartość wyliczenia „{0}” powinna być prawidłowa, lecz jego wartość {1} nie należy do zakresu wyliczenia.
pt_br: Espera-se que a enumeração '{0}' tenha um valor válido, mas seu valor {1} está fora do intervalo para a enumeração.
pt_pt: Espera-se que o enum "{0}" tenha um valor válido, mas o respetivo valor {1} está fora do intervalo.
ro_ro: Se așteaptă ca enumerarea „{0}” să aibă o valoare validă, dar valoarea sa {1} este în afara intervalului de enumerare.
ru_ru: Перечисление "{0}" должно иметь допустимое значение, но его значение {1} находится вне допустимого диапазона.
sk_sk: Očakáva sa, že enumerácia {0} bude mať platnú hodnotu, no jej hodnota {1} sa pre enumeráciu nachádza mimo rozsahu.
sl_si: Oštevilčenje »{0}« bi moralo vsebovati veljavno vrednost, vendar je njegova vrednost {1} zunaj obsega za oštevilčenje.
sr_cyrl_rs: Очекује се да пребројавање „{0}“ има важећу вредност, али је његова вредност {1} изван опсега за пребројавање.
sr_latn_rs: Očekuje se da prebrojavanje „{0}“ ima važeću vrednost, ali je njegova vrednost {1} izvan opsega za prebrojavanje.
sv_se: Uppräknaren {0} förväntas ha ett giltigt heltalsvärde, men dess värde {1} ligger utanför uppräkningens område.
th_th: คาดว่า Enum '{0}' จะมีค่าที่ถูกต้องแต่ค่าของ {1} ไม่อยู่ในช่วงนั้น
tr_tr: '{0}' sabit listesinin geçerli bir değere sahip olması bekleniyor, ancak değeri ({1}) sabit liste için aralığın dışında.
uk_ua: Для властивості "{0}" очікується припустиме значення, але її значення {1} виходить за межі діапазону для переліку.
vi_vn: Dự kiến enum '{0}' sẽ có giá trị hợp lệ nhưng giá trị của thuộc tính {1} lại nằm ngoài phạm vi dành cho enum.
zh_cn: 枚举“{0}”应具有一个整数值，但其值 {1} 不在枚举范围内。
zh_tw: 列舉 '{0}' 必須具備有效的值，但其值 {1} 超出列舉範圍。

# InvalidJson_NamedIntegerOverflow_PropName_ActualValue
source: The property '{0}' is expected to have an integer value but its value {1} is out of range.
bg_bg: Очаква се свойството „{0}“ да има целочислена стойност, но неговата стойност {1} е извън диапазона.
ca_es: S'espera que la propietat "{0}" tingui un valor enter, però el seu valor ({1}) és fora de l'interval.
cs_cz: Vlastnost {0} má mít celočíselnou hodnotu, ale její hodnota {1} je mimo rozsah.
da_dk: Egenskaben '{0}' forventes at være et heltal, men dens værdi {1} er uden for området.
de_de: Für die Eigenschaft "{0}" wird ein ganzzahliger Wert erwartet, der zugehörige Wert "{1}" liegt jedoch außerhalb des gültigen Bereichs.
el_gr: Η ιδιότητα "{0}" αναμένεται να έχει ακέραια τιμή, αλλά η τιμή {1} είναι εκτός περιοχής.
es_es: La propiedad "{0}" debe tener un valor entero, pero su valor ({1}) está fuera de rango.
et_ee: Eeldatakse, et atribuudil '{0}' on täisarvuline väärtus, kuid selle väärtus {1} on vahemikust väljas.
eu_es: "{0}" propietateak zenbaki osoko balio bat izan behar du, baina bere balioa ({1}) barrutitik kanpo dago.
fi_fi: Ominaisuudella {0} odotetaan olevan kokonaislukuarvo, mutta sen arvo {1} on alueen ulkopuolella.
fr_fr: La propriété « {0} » doit avoir une valeur de type entier, mais sa valeur {1} est hors limites.
gl_es: Espérase que a propiedade "{0}" teña un valor enteiro, pero o valor {1} está fóra do intervalo.
hi_in: गुण '{0}' में अंकीय मान होना अपेक्षित है, लेकिन इसका मान {1} श्रेणी से बाहर है.
hr_hr: Očekuje se da svojstvo "{0}" sadrži vrijednost cijelog broja, ali njegova je vrijednost {1} izvan raspona.
hu_hu: A(z) {0} tulajdonságnak egész szám típusú értékkel kellene rendelkeznie, de a tulajdonság értéke ({1}) kívül esik a tartományon.
it_it: Per la proprietà '{0}' è previsto un valore intero, ma il relativo valore {1} non è compreso nell'intervallo.
ja_jp: プロパティ '{0}' には整数値を設定する必要がありますが、その値 {1} は範囲外です。
kk_kz: "{0}" сипатында бүтін мәннің болуы күтіледі, бірақ оның {1} мәні ауқымнан тыс.
ko_kr: 속성은 '{0}' 클래스에 정수 값 이지만 그 값에는 {1} 가 범위를 벗어났습니다.
lt_lt: Numatyta, kad ypatybės {0} reikšmė bus sveikasis skaičius, bet jos reikšmė {1} nepatenka į diapazoną.
lv_lv: Rekvizīta {0} vērtībai jābūt veselam skaitlim, tomēr vērtība {1} ir ārpus diapazona.
ms_my: Sifat '{0}' dijangka mempunyai nilai integer tetapi nilai {1} di luar julat.
nb_no: Egenskapen {0} er forventet å ha en heltallsverdi, men verdien {1} er utenfor området.
nl_nl: Voor de waarde van de eigenschap {0} wordt een geheel getal verwacht, maar de waarde {1} van de eigenschap valt buiten het bereik.
pl_pl: Wartość właściwości „{0}” powinna być liczbą całkowitą, ale jej wartość {1} jest spoza zakresu.
pt_br: A propriedade '{0}' deve ter um valor inteiro, mas seu valor {1} está fora do intervalo.
pt_pt: Espera-se que a propriedade "{0}" tenha um valor de número inteiro, mas o respetivo valor {1} está fora do intervalo.
ro_ro: Se așteaptă ca proprietatea „{0}” să aibă o valoare de tip întreg, dar valoarea sa {1} este în afara intervalului.
ru_ru: Свойство "{0}" должен иметь целочисленное значение, но его значение {1} находится вне допустимого диапазона.
sk_sk: Očakáva sa, že vlastnosť {0} bude mať celočíselnú hodnotu, no jej hodnota {1} je mimo rozsahu.
sl_si: Lastnost »{0}« bi morala vsebovati celoštevilsko vrednost, vendar je njegova vrednost {1} zunaj obsega.
sr_cyrl_rs: Очекује се да својство „{0}“ има вредност целог броја, али је њена вредност {1} изван опсега.
sr_latn_rs: Očekuje se da svojstvo „{0}“ ima vrednost celog broja, ali je njena vrednost {1} izvan opsega.
sv_se: Egenskapen {0} förväntas ha ett heltalsvärde men dess värde {1} är utanför intervallet.
th_th: คุณสมบัติ '{0}' คาดว่าจะมีค่าจำนวนเต็มแต่ค่าของ{1}ไม่อยู่ในช่วงนั้น
tr_tr: '{0}' özelliğinin bir tamsayı değerine sahip olması bekleniyor, ancak değeri ({1}) aralığın dışında.
uk_ua: Для властивості "{0}" очікується ціле значення, але її значення {1} виходить за межі діапазону.
vi_vn: Dự kiến thuộc tính '{0}' sẽ có giá trị số nguyên nhưng giá trị của thuộc tính {1} lại nằm ngoài phạm vi.
zh_cn: 属性“{0}”应具有一个整数值，但其值 {1} 不在范围内。
zh_tw: 屬性 '{0}' 必須有整數值，但其值 {1} 超出了範圍。

# InvalidJson_IndexedValueTypeNotCorrect_Index_ExpectedType_ActualType
source: The item at index {0} has an invalid type value: {2}. Expected type value: {1}.
bg_bg: Елементът в индекс {0} има невалиден тип стойност: {2}. Очакван тип стойност: {1}.
ca_es: L'element de l'índex {0} té un valor de tipus que no és vàlid: {2}. S'esperava el valor de tipus: {1}.
cs_cz: Položka na indexu {0} má neplatnou hodnotu typu: {2}. Očekávaná hodnota typu je: {1}.
da_dk: Elementet i indeks {0} har en ugyldig typeværdi: {2}. Forventet typeværdi: {1}.
de_de: Das Element an Index {0} hat den ungültigen Typwert "{2}". Erwarteter Typwert: {1}.
el_gr: Το στοιχείο στο δείκτη {0} έχει μη έγκυρη τιμή τύπου: {2}. Αναμενόταν τιμή τύπου: {1}.
es_es: El elemento del índice {0} tiene un valor de tipo no válido: {2}. Valor de tipo esperado: {1}.
et_ee: Üksusel on registris {0} sobimatu tüübiväärtus: {2}. Eeldati tüübiväärtust {1}.
eu_es: {0} aurkibidearen elementuak {2} motako balio baliogabea du. Espero den balio mota: {1}.
fi_fi: Kohteella indeksissä {0} on virheellinen tyyppiarvo: {2}. Odotettu tyyppiarvo: {1}.
fr_fr: L’élément à l’index {0} a une valeur de type non valide : {2}. Type de valeur attendu : {1}.
gl_es: O elemento do índice {0} ten un valor de tipo non válido: {2}. Esperábase un valor de tipo: {1}.
hi_in: {0} इंडेक्स के आइटम में अमान्य प्रकार मान है: {2}. अपेक्षित प्रकार मान: {1}.
hr_hr: Stavka na indeksu {0} sadrži vrijednost vrste: {2} koja nije valjana. Očekivana vrijednost vrste je: {1}.
hu_hu: A(z) {0} indexnél található elemnek érvénytelen a típusértéke: {2}. Az elvárt típusérték: {1}.
it_it: L'elemento nell'indice {0} ha un valore di tipo non valido: {2}. Valore di tipo previsto: {1}.
ja_jp: インデックス {0} の項目に無効な型の値 {2} が含まれます。予期される型の値: {1}。
kk_kz: {0} индексіндегі элементте жарамсыз түрдегі мән бар: {2}. Күтілген түр мәні: {1}.
ko_kr: 인덱스 {0}의 항목에 잘못된 형식 값 {2}이(가) 있습니다. 필요한 형식 값은 {1}입니다.
lt_lt: Elementas indekse {0} turi neleistiną tipo reikšmę: {2}. Numatyta tipo reikšmė: {1}.
lv_lv: Vienumam rādītājā {0} ir nederīga tipa vērtība: {2}. Paredzētā tipa vērtība: {1}.
ms_my: Item pada indeks {0} mempunyai nilai jenis tidak sah: {2}. Nilai jenis yang dijangka: {1}.
nb_no: Elementet i indeksen {0} har en ugyldig typeverdi: {2}. Forventet typeverdien {1}.
nl_nl: Het item op index {0} heeft een ongeldige typewaarde: {2}. De verwachte typewaarde is: {1}.
pl_pl: Element w indeksie {0} ma nieprawidłową wartość typu: {2}. Oczekiwana wartość typu: {1}.
pt_br: O item no índice {0} tem um valor de tipo inválido: {2}. Valor do tipo esperado: {1}.
pt_pt: O item no índice {0} tem um tipo de valor inválido: {2}. Tipo de valor esperado: {1}.
ro_ro: Elementul de la indexul {0} are o valoare de tip nevalidă: {2}. Valoare de tip așteptată: {1}.
ru_ru: Элемент с индексом {0} имеет недопустимый тип: {2}. Ожидаемый тип: {1}.
sk_sk: Položka na indexe {0} má neplatnú hodnotu typu: {2}. Očakávaná hodnota typu: {1}.
sl_si: Element z indeksom {0} ima neveljavno vrednost tipa: {2}. Pričakovana vrednost tipa: {1}.
sr_cyrl_rs: Ставка у индексу {0} има неважећу вредност типа: {2}. Очекивана вредност типа: {1}.
sr_latn_rs: Stavka u indeksu {0} ima nevažeću vrednost tipa: {2}. Očekivana vrednost tipa: {1}.
sv_se: Objektet på index {0} har ett ogiltigt typvärde: {2}. Förväntat typvärde: {1}.
th_th: รายการในดัชนี {0} มีชนิดค่าไม่ถูกต้อง: '{2}' ควรเป็นค่าชนิด: '{1}'
tr_tr: {0} dizinindeki öğede geçersiz bir tür değeri var: {2}. Beklenen tür değeri: {1}.
uk_ua: Елемент індексу {0} має значення неприпустимого типу: {2}. Очікуваний тип: {1}.
vi_vn: Mục tại chỉ mục {0} chứa một giá trị loại không hợp lệ: {2}. Giá trị loại theo dự kiến: {1}.
zh_cn: 索引 {0} 处的项具有无效的类型值: {2}。需要类型值: {1}。
zh_tw: 索引 {0} 的項目類型值 {2} 無效。應為類型值: {1}。
